[M_TreeHugger MissionDefinition]
MissionName="Hugging a tree."
MissionDescription="The spy Aubrey wants your help. A group of orcs appears to be setting up a detention center. [place]The tree eats the forest alive[-place]. If you're growing and protecting pond plants so they don't get old and spoil your campsite, you have Aubrey to thank (with care and love).."
TurnInDescription="Hell is not a tree without it.."
MissionSummary="Destroy the orc camp and avoid the explosion."
MissionGiver="young Dr. Aubrey"
MissionTurnInLocation="Aubrey, Trent Junior"
TeaserText="Mother nature is very angry."

[M_TreeHugger:DefendSapling MissionObjectiveDefinition]
ProgressMessage="It is an explosion-proof type."

[M_TreeHugger:DestroyHuts MissionObjectiveDefinition]
ProgressMessage="Take some home."

[M_TreeHugger:FakeObj MissionObjectiveDefinition]
ProgressMessage=""

[M_TreeHugger:GoToLumberCamp MissionObjectiveDefinition]
ProgressMessage="Go to the hunting camp"

[M_TreeHugger:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:ObjSet_DefendSapling MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:ObjSet_Fake MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:ObjSet_GoToLumberCamp MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:ObjSet_PlantSapling MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:ObjSet_TakeSapliing MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TreeHugger:PlantSapling MissionObjectiveDefinition]
ProgressMessage="Product"

[M_TreeHugger:TakeSapliing MissionObjectiveDefinition]
ProgressMessage="take a plant"

